Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: It turns out that in addition to the commit SHA-1 checksum, Git also calculates a checksum that is based just on the patch introduced with the commit.
cs: Věc se má tak, že Git pro objekt revize kromě kontrolního součtu (SHA-1) počítá také kontrolní součet, který vychází pouze ze záplat, které s revizí vznikají.

source: It turns out that it can.
cs: A podívejme, ono to jde.

source: It turns out that you can write your own filters for doing substitutions in files on commit/checkout.
cs: Jak zjistíte, můžete pro substituce v souborech určených k zapsání/checkoutu napsat i vlastní filtry.

source: It turns out there is no issue here, and you tell Git that by typing `git bisect good` and continue your journey:
cs: Ukáže se, že na této revizi k problému nedochází, a tak to systému Git sdělíte příkazem `git bisect good` a budete v hledání pokračovat:

source: It turns out you can do this fairly well using Git attributes.
cs: Nezapomínejme však na atributy Git, v této situaci vám odvedou nanahraditelnou službu.

source: It uses the same data-transfer mechanism as the SSH protocol but without the encryption and authentication overhead.
cs: Používá stejný mechanismus přenosu dat jako protokol SSH, na rozdíl od něj ale není zpomalován šifrováním a ověřováním identity (autentizací).

source: It was starting to gain steam in certain communities, but had not reached anywhere near the ubiquity it has today.
cs: V určitých kruzích si začínal získávat jméno, ale zdaleka nedosahoval všudypřítomnosti, jakou můžeme pozorovat nyní.

source: It will also use these values to help you when you apply patches with `git apply`.
cs: Git se těmito hodnotami řídí také při aplikaci záplat příkazem `git apply`.

source: It will simply get the data for you and let you merge it yourself.
cs: Prostě pro vás jen vyzvedne data a sloučení nechá na vás.

source: It will start at the commit you specify on the command line (`HEAD~3`) and replay the changes introduced in each of these commits from top to bottom.
cs: Začne na revizi, kterou jste označili na příkazovém řádku (`HEAD~3`), a přehraje změny provedené v každé z těchto revizí od shora dolů.

source: It works by going to the common ancestor of the two branches (the one you're on and the one you're rebasing onto), getting the diff introduced by each commit of the branch you're on, saving those diffs to temporary files, resetting the current branch to the same commit as the branch you are rebasing onto, and finally applying each change in turn.
cs: Funguje to tak, že se přejde na společného předka obou větví (větve, na níž se nacházíte, a větve, na kterou přeskládáváte), zjistí se rozdíly pro každý objekt revize ve větvi, na které se nacházíte, zjištěné rozdíly se uloží do dočasných souborů, aktuální větev se nastaví na stejný bod jako větev, na kterou přeskládáváte, a nakonec postupně aplikují všechny změny.

source: It's also a good idea to use the imperative present tense in these messages.
cs: Doporučuje se také, aby se pro zápis zpráv používal rozkazovací způsob.

source: It's also common to add a `last` command, like this:
cs: Běžně se také přidává příkaz `last`:

source: It's been a great pleasure and privilege to work on this book.
cs: Bylo mi velkým potěšením a poctou, že jsem se mohl prací na této knize zúčastnit.

source: It's been amazing to watch Git grow over the past few years from a relatively obscure version control system to basically dominating commercial and open source version control.
cs: Bylo úžasné pozorovat, jak během několika minulých let Git vyrostl z poměrně obskurního systému v systém pro správu verzí, který v podstatě dominuje vývoji v oblasti komerční i v oblasti Open Source.

source: It's best to have a clean working state when you switch branches.
cs: Nejlepší je, když máte při přepínání větví čistý pracovní stav.

source: It's easiest to push the topic branch you're working on up to your repository, rather than merging into your master branch and pushing that up.
cs: Lepší bude, když do repozitáře odešlete svou tématickou větev (v které pracujete) než abyste výsledek začlenili (merge) do své větve `master` a odesílali tuto větev.

source: It's generally a little clearer what the latest version is on the GitHub page, but the kernel.org page also has release signatures if you want to verify your download.
cs: Na stránce GitHub se dá trochu líp poznat, co je poslední verze, ale pokud si chcete stažený archiv zkontrolovat, naleznete na stránce kernel.org navíc k archivu i podpisy.

source: It's generally easier to think about them as work silos, where sets of commits graduate to a more stable silo when they're fully tested.
cs: Většinou je jednodušší uvažovat o větvích jako o pracovních zásobnících, kdy sada revizí postupuje do stabilnějšího zásobníku až po úplném otestování.

source: It's generally recommended that you create annotated tags so you can have all this information; but if you want a temporary tag or for some reason don't want to keep the other information, lightweight tags are available too.
cs: Obecně se doporučuje používat v zájmu úplnosti informací spíše anotované značky. Pokud však vytváříte pouze dočasnou značku nebo z nějakého důvodu nechcete zadávat podrobnější informace, můžete využívat i prosté značky.

source: It's generally used by huge projects with hundreds of collaborators; one famous example is the Linux kernel.
cs: Většinou se používá u obřích projektů se stovkami spolupracovníků. Možná nejznámějším příkladem je vývoj jádra Linuxu.

source: It's important to note that `git diff` by itself doesn't show all changes made since your last commit – only changes that are still unstaged.
cs: Důležité je to, že `git diff` sám o sobě nezobrazí všechny změny provedené od poslední revize, ale jen změny, které zatím nejsou připraveny k zapsání.

source: It's important to note that the `git fetch` command pulls the data to your local repository – it doesn't automatically merge it with any of your work or modify what you're currently working on.
cs: Měli bychom zmínit, že příkaz `fetch` stáhne data do vašeho lokálního repozitáře. Neprovede ale automatické sloučení (merge) s vaší prací, ani nezmění nic z toho, na čem právě pracujete.

source: It's important to note that these numbers are only since the last time you fetched from each server.
cs: Měli bychom poznamenat, že tato čísla se vztahují k poslednímu času, kdy jsme z každého serveru vyzvedli data (fetch).

source: It's important to note that when you do a fetch that brings down new remote-tracking branches, you don't automatically have local, editable copies of them.
cs: Tady je důležité upozornit, že pokud provedete vyzvednutí (fetch), které získá i nové vzdáleně sledované větve, nezískáváte automaticky i jejich lokální, editovatelné kopie.

source: It's important to remember when you're doing all this that these branches are completely local.
cs: Při tom všem, co nyní děláte, je důležité mít na paměti, že všechny tyto větve jsou zcela lokální.

source: It's incredibly fast, it's very efficient with large projects, and it has an incredible branching system for non-linear development (See <<_git_branching>>).
cs: Je extrémně rychlý, velmi efektivně pracuje s velkými projekty a nabízí skvělý systém větvení pro nelineární způsob vývoje (viz kapitola <<_git_branching>>).

source: It's now time to learn some Git basics.
cs: Nastal čas, abychom se naučili základům práce s Gitem.

source: It's pretty safe to assume that the other developer doesn't want `C4` and `C6` to be in the history; that's why they rebased in the first place.
cs: Dá se předpokládat, že druhý vývojář nechtěl, aby byly `C4` a `C6` součástí historie. To je důvodem, proč přeskládání vůbec prováděl.

source: It's sometimes referred to as the ``index'', but it's also common to refer to it as the staging area.
cs: Někdy se setkáme s označením „index“, ale běžně se používá i pojem oblast připravených změn (staging area).

source: It's used to pull in topic branches (short-lived branches, like your earlier `iss53` branch) when they're ready, to make sure they pass all the tests and don't introduce bugs.
cs: Do ní se vtahují tématické větve (ty dočasné, jako byla dřívější větev `iss53`) jakmile jsou připravené -- abychom zajistili, že projdou všemi testy a nezavlečou chyby.

source: It's worth mentioning that this changes your remote branch names, too.
cs: Za zmínku stojí, že tím změníte také názvy vzdálených větví.

source: It's worth noting here that the work you did in your `hotfix` branch is not contained in the files in your `iss53` branch.
cs: Za zmínku stojí, že práce, kterou jste udělali ve větvi `hotfix`, není obsažena v souborech ve větvi `iss53`.

source: It's worth pointing out that Git determines the best common ancestor to use for its merge base; this is different than older tools like CVS or Subversion (before version 1.5), where the developer doing the merge had to figure out the best merge base for themselves.
cs: Za zmínku stojí, že Git určí nejlepšího společného předka, jako základ pro slučování. Tím se liší od starších nástrojů jako CVS nebo Subversion (před verzí 1.5), kde si musel nejlepší základ pro slučování určit sám vývojář, který sloučení prováděl.

source: It’s also possible for Git to stage certain parts of files and not the rest.
cs: Git také může připravit k zapsání pouze určité části souborů a ignorovat jejich zbytek.

source: It’s also possible to take a series of commits and squash them down into a single commit with the interactive rebasing tool.
cs: Další možností, jak lze využít interaktivního nástroje přeskládání, je komprimace série revizí do jediné revize.

source: It’s generally a good idea to do this in a testing branch and then hard-reset your master branch after you’ve determined the outcome is what you really want.
cs: Většinou se vyplatí provádět toto všechno v testovací větvi a k tvrdému resetu hlavní větve přistoupit až poté, co se ujistíte, že výsledek odpovídá vašim očekáváním.

source: It’s important to note that these commits are listed in the opposite order than you normally see them using the `log` command.
cs: Tady bychom chtěli upozornit, že revize jsou uvedeny v opačném pořadí, než jste zvyklí v případě příkazu `log`.

source: It’s important to note that this file is version-controlled with your other files, like your `.gitignore` file.
cs: Za zmínku stojí, že je tento soubor verzován spolu s ostatními soubory, podobně jako třeba soubor `.gitignore`.

source: It’s pushed and pulled with the rest of your project.
cs: Soubor se odesílá a stahuje se zbytkem projektu.

source: Jessica can now merge this into the work she did with `git merge`:
cs: Nyní může Jessica začlenit tyto změny do své práce příkazem `git merge`:

source: Jessica doesn't have push access to the `master` branch – only the integrators do – so she has to push to another branch in order to collaborate with John:
cs: Jessica nemá oprávnění pro odesílání dat (push) do větve `master` (ten mají pouze integrátoři), takže aby mohla s Johnem spolupracovat, musí své revize odeslat do jiné větve:

source: Jessica emails John to tell him that she's pushed some work into a branch named `featureA` and he can look at it now.
cs: Jessica e-mailem Johnovi sdělí, že odeslala svou práci do větve pojmenované `featureA` a že se na ni může podívat.

source: Jessica first needs to merge those changes in with her own before she can push to the server.
cs: Než bude Jessica moci odeslat svou práci na server, bude do ní nejprve muset začlenit práci Josie.

source: Jessica thinks her topic branch is ready, but she wants to know what she has to merge into her work so that she can push.
cs: Jessica považuje svou tématickou větev za dokončenou, ale chce zjistit, co by měla do své práce začlenit, aby ji mohla odeslat.

source: Jessica wants to sync up with John, so she fetches:
cs: Jessica chce synchronizovat svou práci s Johnem, a proto vyzvedne jeho data:

source: Jessica wants to tweak something, so she commits again and then pushes this back up to the server:
cs: Jessica by ráda něco vylepšila, a proto vytvoří novou revizi a odešle ji zpět na server:

source: Jessica's commit history now looks something like this:
cs: Historie revizí Jessicy bude nyní vypadat takto:

source: Jessica's history now looks like this:
cs: Historie revizí Jessicy teď vypadá takto:

source: Jessica's repository looks like this:
cs: Jessičin repozitář vypadá nějak takto:

source: Jessica, Josie, and John inform the integrators that the `featureA` and `featureBee` branches on the server are ready for integration into the mainline.
cs: Jessica, Josie a John pošlou zprávu integrátorům, že větve `featureA` a `featureBee` jsou na serveru připraveny k integraci do hlavní linie.

source: John finishes his change and pushes it to the server.
cs: John dokončí své úpravy a odešle je na server.

source: John has a reference to the changes Jessica pushed up, but he has to merge them into his own work before he is allowed to push:
cs: John má k dispozici odkaz na změny, které odeslala Jessica, ale než bude moci sám odeslat svá data, bude muset začlenit její práci:

source: John has to fetch Jessica's changes and merge them in before he will be allowed to push:
cs: John musí vyzvednout (fetch) změny, které provedla Jessica, a začlenit je (merge) do své práce. Teprve potom mu bude umožněno je odeslat (push):

source: John isn't allowed to push because Jessica has pushed in the meantime.
cs: John nemá povoleno odeslat změny, protože mezitím odeslala své změny Jessica.

source: John tries to push his change up, too:
cs: Také John se pokusí odeslat své změny na server:

source: Just go to http://git-scm.com/download/win[] and the download will start automatically.
cs: Skočte na stránku http://git-scm.com/download/win[] a stahování se zahájí automaticky.

source: Just type `git tag`:(((git commands, tag)))
cs: Napište `git tag`:(((git příkazy, tag)))

source: Last, we'll go over a few hosted options, if you don't mind hosting your code on someone else's server and don't want to go through the hassle of setting up and maintaining your own server.
cs: Nakonec se podíváme na několik možností hostování -- pokud vám nevadí, že máte kód umístěný na cizím serveru, a nechcete se otravovat s nastavováním a údržbou svého vlastního serveru.

source: Lastly, you have this:
cs: A na konci stojí následující:

source: Let's change a file that was already tracked.
cs: Nyní provedeme změny v souboru, který už byl sledován.

source: Let's create a hotfix branch on which to work until it's completed:
cs: Vytvořme si pro ni větev, na níž budeme pracovat, dokud nebude oprava hotová:

source: Let's do what it says:
cs: Uděláme, co nám radí:

source: Let's follow Jessica's workflow as she works on her two features, collaborating in parallel with two different developers in this environment.
cs: Sledujme pracovní postup Jessicy pracující na dvou úkolech a spolupracující v tomto prostředí paralelně s dvěma různými vývojáři.

source: Let's go through a simple example of branching and merging with a workflow that you might use in the real world.
cs: Proberme si jednoduchý příklad větvení a slučování s pracovním postupem, který můžete využít i v reálném životě.

source: Let's look at an example of how rebasing work that you've made public can cause problems.
cs: Podívejme se na příklad toho, jaké problémy může přeskládání již zveřejněných dat způsobit.

source: Let's look at one more possible scenario: the maintainer has looked at work in your second branch and likes the concept but would like you to change an implementation detail.
cs: Podívejme se na ještě jeden možný scénář: Správce se podíval na práci ve vaší druhé větvi a tento koncept se mu líbí, ale rád by, abyste změnili jeden implementační detail.

source: Let's make a few changes and commit again:
cs: Proveďme pár změn a zapišme další revizi:

source: Let's say that John and Jessica are working together on one feature, while Jessica and Josie are working on a second.
cs: Řekněme, že John a Jessica spolupracují na jednom úkolu, zatímco Jessica a Josie pracují na jiném.

source: Let's say the project maintainer has pulled in a bunch of other patches and tried your first branch, but it no longer cleanly merges.
cs: Řekněme, že správce projektu vtáhl do projektu několik jiných záplat a vyzkoušel vaši první větev, ale ta už se nedá začlenit čistě.

source: Let's say you add a new file to your project, a simple README file.
cs: Řekněme, že nyní přidáte do projektu nový soubor, například soubor `README`.

source: Let's say you create a new branch called testing.
cs: Řekněme, že vytvoříte novou větev a nazvete ji testing.

source: Let's say you decide to pull in your server branch as well.
cs: Řekněme, že se později rozhodnete vtáhnout i větev `server`.

source: Let's say you edit and stage the `README` file again and then edit the `CONTRIBUTING.md` file without staging it.
cs: Řekněme, že znovu upravíte a připravíte soubor `README` a poté upravíte soubor `CONTRIBUTING.md`, ale nepřipravíte jej k zápisu.

source: Let's say you have a Git server on your network at `git.ourcompany.com`.
cs: Řekněme, že máte v síti gitový server označený `git.ourcompany.com`.

source: Let's see what it might look like when two developers start to work together with a shared repository.
cs: Podívejme se, jak to může vypadat, když dva vývojáři začnou spolupracovat na projektu se sdíleným repozitářem.

source: Let's see why you should do so.
cs: Podívejme se, proč byste to měli dělat také tak.

source: Let's switch back to the `master` branch:
cs: Přepněme zpět na větev `master`.

source: Let’s say you just pushed out a release of your code to a production environment, you’re getting bug reports about something that wasn’t happening in your development environment, and you can’t imagine why the code is doing that.
cs: Řekněme, že jste právě odeslali vydání svého zdrojového kódu do produkčního prostředí, ale dostanete hlášení o chybě, která se ve vašem vývojovém prostředí nevyskytovala, a nemáte tušení, proč kód takto zlobí.

source: Lieutenants merge the developers' topic branches into their `master` branch.
cs: Poručíci začleňují (merge) tématické větve vývojářů do svých větví `master`.

source: Listing the available tags in Git is straightforward.
cs: Pořízení výpisu dostupných značek (tags) je v systému Git jednoduché.

source: Local VCS systems suffer from this same problem – whenever you have the entire history of the project in a single place, you risk losing everything.
cs: Lokální systémy pro správu verzí trpí stejným problémem. Kdykoliv máte celou historii projektu uloženou na jednom místě, riskujete, že přijdete o vše.

source: Looking at your Git status again, you can see that you’ve unstaged the TODO file:
cs: Pokud se nyní znovu podíváte na stav Git souboru TODO, uvidíte, že už není připraven k zapsání:

source: Love it or hate it, GitHub has heavily changed large swaths of the Open Source community in a way that was barely conceivable when I sat down to write the first edition.
cs: Ať už se vám to líbí nebo ne, GitHub významně ovlivnil Open Source komunitu způsobem, který byl v době psaní prvního vydání stěží představitelný.

source: Luckily, Git provides a tool to help you send properly formatted patches via IMAP, which may be easier for you.
cs: Git naštěstí nabízí nástroj, který vám pomůže odeslat správně formátované patche pomocí protokolu IMAP.

source: Luckily, `git status` tells you how to do that, too.
cs: Příkaz `git status` vám naštěstí i tentokrát řekne, co dělat.

source: Managing remote repositories includes knowing how to add remote repositories, remove remotes that are no longer valid, manage various remote branches and define them as being tracked or not, and more.
cs: Při správě vzdálených repozitářů musíte vědět, jak lze přidat vzdálený repozitář, jak odstranit vzdálený repozitář, který už není platný, jak spravovat různé vzdálené větve, jak je určit jako sledované či nesledované a další věci.

source: Many Git developers have a workflow that embraces this approach, such as having only code that is entirely stable in their `master` branch – possibly only code that has been or will be released.
cs: Řada vývojářů, kteří Git používají, si tento přístup osvojila, takže například ve větvi `master` uchovávají kód, který je zcela stabilní -- kód, který byl nebo bude součástí zveřejněné verze.

source: Many groups switch to Git because of this ability to have multiple teams working in parallel, merging the different lines of work late in the process.
cs: Mnoho skupin přechází na Git právě kvůli této možnosti paralelní spolupráce několika týmů a následného slučování různých linií práce.

source: Many hosting sites support this (including GitHub, BitBucket, Google Code, repo.or.cz, and others), and many project maintainers expect this style of contribution.
cs: Tento mechanismus podporuje řada hostitelských serverů (včetně GitHub, BitBucket, Google Code, repo.or.cz a dalších) a řada správců projektů takový styl přispívání očekává.

source: Many of the GUI tools will help you do this when you first run them.
cs: Mnohé nástroje s grafickým uživatelským rozhraním vám s nastavením při prvním spuštění pomohou.

source: Many times, when working with Git, you may want to revise your commit history for some reason.
cs: Při práci se systémem Git možná budete z nějakého důvodu čas od času potřebovat poopravit historii revizí.

source: Modified means that you have changed the file but have not committed it to your database yet.
cs: Změněno znamená, že v souboru byly provedeny změny, avšak soubor ještě nebyl zapsán do databáze.

source: More detailed explanatory text, if necessary.
cs: Podrobnější vysvětlující text, pokud je třeba.

source: More important, you can use any tool you like to rename a file, and address the add/rm later, before you commit.
cs: Důležitější je, že můžete použít jakýkoli způsob přejmenování a později, před zapsáním revize, provést příkaz `add`/`rm`.

source: Most of the examples in the book have been changed to HTTP from SSH because it's so much simpler.
cs: Většina příkladů v knize byla změněna z použití SSH na použití HTTP, protože je to mnohem jednodušší.

source: Most of the time, this command does nothing.
cs: Ve většině případů neprovede tento příkaz vůbec nic.

source: Most operations in Git only need local files and resources to operate – generally no information is needed from another computer on your network.
cs: Většina operací v systému Git vyžaduje ke své činnosti pouze lokální soubory a zdroje. Obecně platí, že informace z jiných počítačů v síti nejsou potřebné.

source: Much as the `git svn log` command simulates the `svn log` command offline, you can get the equivalent of `svn annotate` by running `git svn blame [FILE]`.
cs: Tak jako příkaz `git svn log` simuluje příkaz `svn log` (bez nutnosti připojení), ekvivalentem příkazu `svn annotate` je provedení `git svn blame [SOUBOR]`.

source: Name this remote `teamone`, which will be your shortname for that whole URL.
cs: Pojmenujte tento vzdálený repozitář jako `teamone`, což bude zkrácený název pro celou URL adresu.

source: Nevertheless, a more common way is to take advantage of remote-tracking branches.
cs: Nicméně, běžnější bývá využití vzdáleně sledovaných větví.

source: New files that aren't tracked have a `??` next to them, new files that have been added to the staging area have an `A`, modified files have an `M` and so on.
cs: Před novými soubory, které nejsou sledované se zobrazuje `??`, před novými soubory, které byly přidány do oblasti připravených k zapsání se zobrazuje `A`, před upravenými soubory se zobrazuje `M` (jako modified) atd.
